README.md

# Table of Contents

1.  [Nome do Software (ou Biblioteca):](#org2313b9b)
2.  [Resumo e/ou informação extra:](#orgb289cc3)
3.  [Versão:](#org27654ad)
4.  [Data:](#org14685fc)
5.  [Autor de Contato:](#orgffa4bcf)
6.  [Lista dos Autores:](#org18f81d5)
7.  [Áreas de pesquisa vinculadas:](#orgdb15429)
8.  [Vinculo com:](#orgeae2cfa)
9.  [Paradigmas:](#org239277c)
10. [Tipo de Interface:](#org179a1a3)
11. [Plataformas Suportadas:](#orgb4d834c)
12. [Linguagens Utilizadas:](#org9045193)
13. [Bibliotecas Utilizadas (dependências):](#org0ce474e)
14. [Softwares utilizados (dependências)](#orgeed7a30)
15. [Tipo de Licença:](#orgee014d5)
16. [Novas Versões](#org73a17fb)
17. [Links:](#orge932de1)



<a id="org2313b9b"></a>

# Nome do Software (ou Biblioteca):
PetroPlanner
-   


<a id="orgb289cc3"></a>

# Resumo e/ou informação extra:

Durante a graduação em Engenharia de Petróleo, muitos estudantes enfrentam dificuldades para organizar sua trajetória acadêmica de forma eficiente. Entre desafios como a escolha de disciplinas, carga horária semanal, estágio, atividades complementares e Trabalho de Conclusão de Curso (TCC), a falta de um planejamento estruturado pode impactar diretamente no desempenho acadêmico.

Diante dessa necessidade, este projeto propõe o desenvolvimento do PetroPlanner, um software interativo que auxilia estudantes no planejamento de sua grade curricular e na gestão do tempo dedicado aos estudos. A ferramenta permitirá a simulação de diferentes cenários acadêmicos, considerando fatores como taxa de aprovação das disciplinas, impacto do adiamento de matérias e carga horária semanal recomendada. Além disso, o software incluirá funcionalidades para acompanhamento de estágios, atividades complementares e progressão do coeficiente de rendimento (CR), oferecendo uma visão mais clara da jornada acadêmica do estudante.

O PetroPlanner será desenvolvido em C++23 com a interface gráfica baseada no Qt 6.6 (ou superior), utilizando SQLite para armazenamento de dados e bibliotecas específicas para gráficos e estatísticas. O diferencial desse projeto está na personalização do planejamento acadêmico para estudantes de engenharia, levando em conta a complexidade e carga horária das disciplinas, o impacto de reprovações e a necessidade de conciliar estudos com a vida pessoal e profissional. Com isso, espera-se que o PetroPlanner se torne uma ferramenta essencial para ajudar universitários a tomar decisões estratégicas ao longo do curso, reduzindo incertezas e contribuindo para uma trajetória acadêmica mais organizada e eficiente.


<a id="org27654ad"></a>

# Versão:

-   1.0.


<a id="org14685fc"></a>

# Data:

-   2025/1 - primeiro semestre.


<a id="orgffa4bcf"></a>

# Autor de Contato:
- Abigail Ribeiro <abigailsilva@lenep.uenf.br>
- Maria Luiza Cornelio <mariaramos@lenep.uenf.br>
- André Duarte Bueno <andreduartebueno@gmail.com>


<a id="org18f81d5"></a>

# Lista dos Autores:

- Abigail Ribeiro <abigailsilva@lenep.uenf.br>
- Maria Luiza Cornelio <mariaramos@lenep.uenf.br>
- André Duarte Bueno <andreduartebueno@gmail.com>


<a id="orgdb15429"></a>

# Áreas de pesquisa vinculadas:

-   Modelagem Matemática Computacional


<a id="orgeae2cfa"></a>

# Vinculo com:

-   [Trabalho da disciplina Projeto de Software Aplicado à Engenharia](https://sites.google.com/view/professorandreduartebueno/ensino/projeto-de-software-aplicado).
-   A metodologia utilizada é descrita [aqui](https://github.com/ldsc/LDSC-ProjetoEngenharia-0-Metodologia-Instrucoes-Etapas).
-   Uma lista de outros projetos desenvolvidos no LDSC é disponibilizado [aqui](https://github.com/ldsc/LDSC-ProjetoEngenharia-0-Metodologia-Instrucoes-Etapas).


<a id="org239277c"></a>

# Paradigmas:

-   POO - Programação Orientada a Objeto (códigos em C++)


<a id="org179a1a3"></a>

# Tipo de Interface:

-   Terminal
-   Qt


<a id="orgb4d834c"></a>

# Plataformas Suportadas:

-   Windows e GNU/Linux e Mac OS X (não testada).


<a id="org9045193"></a>

# Linguagens Utilizadas:

-   C++.


<a id="org0ce474e"></a>

# Bibliotecas Utilizadas (dependências):

-   CGnuplot - <https://github.com/ldsc/CGnuplot>


<a id="orgeed7a30"></a>

# Softwares utilizados (dependências)

-   qt <(https://doc.qt.io/qtcreator/)>


<a id="orgee014d5"></a>

# Tipo de Licença:

-   GPL


<a id="org73a17fb"></a>

# Novas Versões

-   Entre em contato com o Prof. André Duarte Bueno
    andreduartebueno@gmail.com
    para que o mesmo gere um novo projeto no github do ldsc para que você (e sua equipe) possam trabalhar na nova versão.
-   Se este projeto tem como número de versão 1.0 a nova versão deverá ser 2.0 e assim sucessivamente.
-   Os nomes dos autores originais deve ser preservada na nova versão, ou seja, adicione a informação do número da versão, os nomes dos membros da nova equipe, mas jamais apague os nomes dos autores originais (isto seria plágio).
-   Na descrição do projeto informe que trata-se de uma nova versão, que tem como base a versão anterior e DESTAQUE COM CLAREZA E OBJETIVIDADE QUAIS AS NOVIDADES DA NOVA VERSÃO.


<a id="orge932de1"></a>

# Links:

-   [Site do Professor André Duarte Bueno](https://sites.google.com/view/professorandreduartebueno/).
-   [Site do LDSC no github](https://github.com/ldsc).
-   [Site do LENEP](https://uenf.br/cct/lenep).

